callout/src/test/resources/test-data/1-unsigned.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://example.com/ns">
  <soapenv:Header/>
  <soapenv:Body>
    <ns:request>
      <ns:customer>
        <ns:id>123</ns:id>
        <ns:name type="NCHZ">John Brown</ns:name>
      </ns:customer>
    </ns:request>
  </soapenv:Body>
</soapenv:Envelope>
